class HISSystem:
    def __init__(self):
        # จำลองฐานข้อมูลคนไข้
        self.mock_data = {
            "HN001": ["duspatin_135", "orata 0.5","uroflow"], # คนไข้คนนี้ต้องได้ยากล่องเขียวและพารา
            "HN002": ["uroflow"],             # คนไข้คนนี้ได้ยากล่องขาว
        }
    
    def get_patient_drugs(self, hn_id):
        """คืนค่ารายชื่อยาที่คนไข้ต้องได้รับ"""
        drugs = self.mock_data.get(hn_id, [])
        print(f"🏥 HIS Query [{hn_id}]: Prescribed -> {drugs}")
        return drugs